# encoding: utf-8
# language: ru

Функционал: Основной рабочий стол

Как системный аналитик
Я хочу удобное отображение фича-файлов для редактирования во время сбора требования
И удобное отображение количественных и качественных характеристик

Контекст: 
	Когда Существует внешняя обработка 1С
	И у управляемой формы обработки есть три закладки
	И первая закладка называется "Структура требований"
	И вторая закладка называется "Объем проекта"
	И третья закладка называется "Качественные показатели"

# Сценарий: Открытие формы



# Сценарий: Выбор каталога фича-файлов
 


# Сценарий: Сохранение предыдущего выбора 



# Сценарий: Перезаполнение данных формы при изменении каталога



# Сценарий: Закрытие формы


 
