# encoding: utf-8
# language: ru

Функционал: Редактирование сценариев в дереве требований

Как системный аналитик 
Я хочу: редактирование сценариев напрямую в дереве с автоподстановкой ключевых слов Gherkin 
И автоподстановкой значений из базы данных где запущена обработка

Контекст: Есть внешняя обработка 1С 
И активная закладка "Структура требований"

Сценарий: Добавление новой строки сценария



Сценарий: Редактирование текущей строки сценария



Сценарий: Перемещение текущей строки на новую позицию



Сценарий: Удаление текущей строки сценария



Сценарий: Автоподстановка ключевого слова Gherkin



Сценарий: Автоподстановка значений из базы данных




 


