#encoding: utf-8
#language: ru

Функционал: Редактирование feature-файла                                                                                                                  
	Как пользователь BDD-Editor                                                                                                                           
	Я хочу редактировать feature-файл в разных режимах                                                                                                    
	Чтобы было быстро редактировать feature-файл                                                                                                          
	
Контекст:
	Дано 

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда

Сценарий:
	Когда
	И
	Тогда
