#encoding: utf-8
#language: ru

Функционал: Созданние шаблонной структуры каталогов бизнес-компонент                                                                                      
	Как Системный аналитик                                                                                                                                
	Я хочу При первичном открытиии обработки создавать необходимую шаблонную структуру каталогов бизнес-компонент                                         
	Чтобы Изначально структурировать функционал по функциональным заказчикам и функциональной методологии                                                 
	
Контекст:
	Дано: Существует обработка `bdd-editor.epf`
	и я нахожусь на закладке `Структура компонент`

Сценарий: Загрузка шаблонов для систем типа ERP
	Когда
	И
	Тогда

Сценарий: Загрузка шаблонов для систем типа Управления торговлей
	Когда
	И
	Тогда

Сценарий: Загрузка шаблонов для систем типа Бухгалтерия предприятия
	Когда
	И
	Тогда

Сценарий: Загрузка шаблонов для систем типа Зарплата и управления персоналом
	Когда
	И
	Тогда

Сценарий: Загрузка шаблонов для систем с нуля или прочих систем
	Когда
	И
	Тогда


Сценарий: Загрузка шаблонов для внешних обработок и расширений 1С
	Когда
	И
	Тогда

